app/controllers/items_controller.rb

SELECT * FROM `items`
---
  def index
    @items = Item.all