app/controllers/projects_controller.rb

  def index
    #@projects = Project.find(:all, :offset => params[:start], :limit => params[:limit])
    #@dto = DataTransferObject.new
    #@dto.total = Project.count
    #@dto.results = @projects.to_a



	@projects = Project.paginate :page => params[:page], :per_page => params[:limit]
---
SELECT * FROM `projects` LIMIT 0, 5
SELECT count(*) AS count_all FROM `projects`

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def create
    #ActiveRecord::Base.include_root_in_json = false
    #@p = ActiveSupport::JSON.decode(params[:project])
    #@t = request.env['RAW_POST_DATA']
    #@json = params[:project]
    #@p = JSON.parse(@t, opts = {
    #  :max_nesting => 19,
    #  :allow_nan => true
    #})

    items = params[:project].delete("items")
    @project = Project.new(params[:project])

    if items
       items.each do |item|
         @project.items << Item.new(item)
---
INSERT INTO `items` (`created_at`, `project_id`, `updated_at`, `description`) VALUES('2009-06-18 13:41:00', 2, '2009-06-18 13:41:00', 'teste')
INSERT INTO `projects` (`name`, `created_at`, `updated_at`) VALUES('Projeto 1', '2009-06-04 15:12:26', '2009-06-04 15:12:26')

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 4)
DELETE FROM `projects` WHERE `id` = 4