app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', 'b335f3d19af7dfc0904829ceae6bc169e587e3db', '2009-06-10 21:54:03', '9068e46f54cbdb5a165464411e66aa4a2affba5f', NULL, '2009-06-10 21:54:03', NULL, 'cmilfont', 'cmilfont@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save